Revit 2027 API
BuiltInFailures.FabricSheetFailures Class
 Failures related to fabric sheet elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.FabricSheetFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class FabricSheetFailures
Public NotInheritable Class FabricSheetFailures
public ref class FabricSheetFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FabricSheetFailures = class end
The BuiltInFailures.FabricSheetFailures type exposes the following members.
Properties
Name | Description
BentFabricSheetTooLongBendingProfile |  The bent edge is shorter than the bend profile for this fabric sheet type.
FabricSheetOutSideOfHostError |  Fabric Sheet is placed completely outside of its host.
FabricSheetOutSideOfHostWarning |  Fabric Sheet is placed completely outside of its host.
Top
See Also
Reference
Autodesk.Revit.DB Namespace